; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v6 - type_1 ?v3 - type_3)
 	      (pred_3 ?v5 - object ?v3 - type_3)
	      (pred_2 ?v6 - type_1 ?v1 - type_2)
	      (pred_4 ?v6 - type_1 ?v5 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v6 - type_1 ?v4 ?v8 - type_3)
       :precondition (and  (pred_1 ?v6 ?v4))
       :effect (and  (pred_1 ?v6 ?v8)
		     (not (pred_1 ?v6 ?v4))))

   (:action op_3
       :parameters (?v6 - type_1 ?v7 - object ?v2 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v2) (pred_1 ?v6 ?v2) (pred_2 ?v6 ?v1))
       :effect (and (pred_4 ?v6 ?v7 ?v1)
		    (not (pred_3 ?v7 ?v2)) 
		    (not (pred_2 ?v6 ?v1))))

   (:action op_1
       :parameters (?v6 - type_1 ?v7 - object ?v2 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v6 ?v7 ?v1) (pred_1 ?v6 ?v2))
       :effect (and (pred_3 ?v7 ?v2)
		    (pred_2 ?v6 ?v1)
		    (not (pred_4 ?v6 ?v7 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_01 obj_08 - type_2
obj_07 obj_05 obj_09 - type_3
obj_04 obj_02 obj_03 - object)
(:init
(pred_1 obj_06 obj_07)
(pred_2 obj_06 obj_01)
(pred_2 obj_06 obj_08)
(pred_3 obj_04 obj_05)
(pred_3 obj_02 obj_07)
(pred_3 obj_03 obj_05)
)
(:goal
(and
(pred_3 obj_04 obj_05)
(pred_3 obj_02 obj_09)
(pred_3 obj_03 obj_07)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_06 ?b obj_08))))
)
)

; plan
1. (op_3 obj_06 obj_02 obj_07 obj_01)
   deleted: (pred_3 obj_02 obj_07) (pred_2 obj_06 obj_01)
   added: (pred_4 obj_06 obj_02 obj_01)
   goals met: 1 of 3
2. (op_2 obj_06 obj_07 obj_09)
   deleted: (pred_1 obj_06 obj_07)
   added: (pred_1 obj_06 obj_09)
   goals met: 1 of 3
3. (op_1 obj_06 obj_02 obj_09 obj_01)
   deleted: (pred_4 obj_06 obj_02 obj_01)
   added: (pred_3 obj_02 obj_09) (pred_2 obj_06 obj_01)
   goals met: 2 of 3
4. (op_2 obj_06 obj_09 obj_05)
   deleted: (pred_1 obj_06 obj_09)
   added: (pred_1 obj_06 obj_05)
   goals met: 2 of 3
5. (op_3 obj_06 obj_03 obj_05 obj_01)
   deleted: (pred_3 obj_03 obj_05) (pred_2 obj_06 obj_01)
   added: (pred_4 obj_06 obj_03 obj_01)
   goals met: 2 of 3
6. (op_2 obj_06 obj_05 obj_07)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_07)
   goals met: 2 of 3
7. (op_1 obj_06 obj_03 obj_07 obj_01)
   deleted: (pred_4 obj_06 obj_03 obj_01)
   added: (pred_3 obj_03 obj_07) (pred_2 obj_06 obj_01)
   goals met: 3 of 3
